# Exercise 1: Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels

In [2]:
import pandas as pd
import numpy as np
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
sample = ['a','b','c','d','e','f','g','h','i','j']
df = pd.DataFrame(exam_data,index=sample)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# Exercise 2: Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15

In [5]:
print("Number of attempts in the examination is less than 2 and score greater than 15 : \n",df[(df['attempts'] < 2) & (df['score'] > 15)])

Number of attempts in the examination is less than 2 and score greater than 15 :
     name  score  attempts qualify
j  Jonas   19.0         1     yes

# Exerise 3: Change the value in row 'd' to 11.5

In [7]:
print("original dataframe: \n",df)
print()
print("Change the score in row 'd' to 11.5: \n")
df.loc['d', 'score'] = 11.5
print(df)

original dataframe:
         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Change the score in row 'd' to 11.5:

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

# Exercise: Write a Pandas program to calculate the sum of the examination attempts by the students

In [9]:
print("Sum of the examination attempts by the students: \n",df['attempts'].sum())

Sum of the examination attempts by the students:
 19

# Exercise 4: Write a Pandas program that prints the rows which has value 4 in col1

In [50]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df1=pd.DataFrame(d)
print("original Dataframe: \n",df1)
print("Rows for column value=4: \n",df1[df1['col1'] == 4])

original Dataframe:
    col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
Rows for column value=4:
    col1  col2  col3
1     4     5     8
3     4     7     0

# Exercise 5: Drop a list of rows from a specified DataFrame

In [51]:
print("original Dataframe: \n",df1)
print("New DataFrame after removing 2nd & 4th rows: \n")
df1 = df1.drop(df1.index[[2,4]])
print(df1)

original Dataframe:
    col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
New DataFrame after removing 2nd & 4th rows:

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

# Exercise 6: Check whether a given column is present in a DataFrame or not

In [16]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
dfr = pd.DataFrame(d)
print("Original DataFrame: \n",dfr)
if 'col4' in dfr.columns:
  print("Col4 is present in DataFrame.")
else:
  print("Col4 is not present in DataFrame.")
if 'col1' in dfr.columns:
  print("Col1 is present in DataFrame.")
else:
  print("Col1 is not present in DataFrame.")

Original DataFrame:
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Col4 is not present in DataFrame.
Col1 is present in DataFrame.

# Exercise 7: Get column index from column name of a given DataFrame

In [19]:
print("Original DataFrame",dfr)
print()
print("Index of 'col2':",dfr.columns.get_loc("col2"))

Original DataFrame    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

Index of 'col2': 1

# Exercise 8: Write a Pandas program to select all columns, except one given column in a DataFrame

In [22]:
print("Original DataFrame: \n",dfr)
print("All columns except 'col3': \n",dfr.loc[:, dfr.columns != 'col3'])

Original DataFrame:
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
All columns except 'col3':
    col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

# Exercise 9: Write a Pandas program to remove last n rows of a given

In [23]:
dt = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
dtfr = pd.DataFrame(dt)
print("Original DataFrame: \n",dtfr)
print("After removing last 3 rows of the said DataFrame:\n",dtfr.iloc[:3])

Original DataFrame:
    col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
After removing last 3 rows of the said DataFrame:
    col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

# Exercise 10: Display the movies longer than 30 minutes and shorter than 360 minutes

In [37]:
resmov=pd.read_csv('C:\\Users\\User\\Documents\\sumii\\IMDB-Movie-Data.csv',usecols=['Title','Runtime (Minutes)'])
resmov.loc[(resmov['Runtime (Minutes)']>30) & (resmov['Runtime (Minutes)']<360)]

                       Title  Runtime (Minutes)
0    Guardians of the Galaxy                121
1                 Prometheus                124
2                      Split                117
3                       Sing                108
4              Suicide Squad                123
..                       ...                ...
995     Secret in Their Eyes                111
996          Hostel: Part II                 94
997   Step Up 2: The Streets                 98
998             Search Party                 93
999               Nine Lives                 87

[1000 rows x 2 columns]